function getData() {
    var strData="1、水形物语<br/><br/>" +
        "导演: 吉尔莫·德尔·托罗<br/>" +
        "编剧: 吉尔莫·德尔·托罗 / 瓦内莎·泰勒<br/>" +
        "主演: 莎莉·霍金斯 / 道格·琼斯 / 迈克尔·珊农 / 理查德·詹金斯 / 奥克塔维亚·斯宾瑟 / 更多...<br/>" +
        "类型: 剧情 / 爱情 / 奇幻<br/>" +
        "制片国家/地区: 美国<br/>" +
        "语言: 英语 / 美国手语 / 俄语<br/>" +
        "上映日期: 2018-03-16(中国大陆) / 2017-08-31(威尼斯电影节) / 2017-12-01(美国)<br/>" +
        "片长: 123分钟<br/>" +
        "又名: 忘形水(港) / 水底情深(台) / 水形奇缘 / 水之形 / 水的形状 / 水无常形" +
        "<br/><br/><br/>" +
        "2、城市之光<br/><br/>" +
        "导演: 徐纪周<br/>" +
        "编剧: 徐纪周 / 雷米<br/>" +
        "主演: 邓超 / 阮经天 / 刘诗诗 / 文淇 / 林嘉欣 / 更多...<br/>" +
        "类型: 动作 / 悬疑 / 犯罪<br/>" +
        "制片国家/地区: 中国大陆 / 香港<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2017-12-22(中国大陆)<br/>" +
        "片长: 124分钟\n" +
        "又名: 心理罪·城市之光 / 城市之光 / 缉凶者 / The Liquidator" +
        "<br/><br/><br/>" +
        "3、捉妖记2<br/><br/>" +
        "导演: 许诚毅<br/>" +
        "编剧: 吴炜伦 / 陈咏燊 / 苏亮<br/>" +
        "主演: 梁朝伟 / 白百何 / 井柏然 / 李宇春 / 杨祐宁 / 更多...<br/>" +
        "类型: 喜剧 / 奇幻<br/>" +
        "制片国家/地区: 中国大陆 / 香港<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2018-02-16(中国大陆)<br/>" +
        "片长: 110分钟<br/>" +
        "又名: Monster Hunt 2" +
        "<br/><br/><br/>" +
        "4、唐人街探案2<br/><br/>" +
        "导演: 陈思诚<br/>" +
        "编剧: 陈思诚<br/>" +
        "主演: 王宝强 / 刘昊然 / 肖央 / 刘承羽 / 尚语贤 / 更多...<br/>" +
        "类型: 喜剧 / 动作 / 悬疑 / 犯罪<br/>" +
        "制片国家/地区: 中国大陆<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2018-02-16(中国大陆)<br/>" +
        "片长: 121分钟<br/>" +
        "又名: 唐探2 / Detective Chinatown Vol 2" +
        "<br/><br/><br/>" +
        "5、浪矢解忧杂货店<br/><br/>" +
        "导演: 广木隆一<br/>" +
        "编剧: 齐藤浩史 / 东野圭吾<br/>" +
        "主演: 山田凉介 / 村上虹郎 / 宽一郎 / 成海璃子 / 门胁麦 / 更多...<br/>" +
        "类型: 剧情<br/>" +
        "制片国家/地区: 日本<br/>" +
        "语言: 日语<br/>" +
        "上映日期: 2018-02-02(中国大陆) / 2017-09-23(日本)<br/>" +
        "片长: 129分钟<br/>" +
        "又名: 解忧杂货店 / Miracles of the Namiya General Stor" +
        "<br/><br/><br/>" +
        "6、三块广告牌<br/><br/>" +
        "导演: 马丁·麦克唐纳<br/>" +
        "编剧: 马丁·麦克唐纳<br/>" +
        "主演: 弗兰西斯·麦克多蒙德 / 伍迪·哈里森 / 山姆·洛克威尔 / 艾比·考尼什 / 卢卡斯·赫奇斯 / 更多...<br/>" +
        "类型: 剧情 / 犯罪<br/>" +
        "官方网站: www.foxsearchlight.com/threebillboardsoutsideebbingmissouri<br/>" +
        "制片国家/地区: 英国 / 美国<br/>" +
        "语言: 英语<br/>" +
        "上映日期: 2018-03-02(中国大陆) / 2017-09-04(威尼斯电影节) / 2017-12-01(美国)<br/>" +
        "片长: 115分钟<br/>" +
        "又名: 意外(台) / 广告牌杀人事件(港)" +
        "<br/><br/><br/>" +
        "7、黑豹<br/><br/>" +
        "导演: 瑞恩·库格勒<br/>" +
        "编剧: 瑞恩·库格勒 / 乔·罗伯特·科尔 / 斯坦·李 / 杰克·科比<br/>" +
        "主演: 查德维克·博斯曼 / 露皮塔·尼永奥 / 迈克尔·B·乔丹 / 丹娜·奎里拉 / 马丁·弗瑞曼 / 更多...<br/>" +
        "类型: 动作 / 科幻 / 冒险<br/>" +
        "制片国家/地区: 美国<br/>" +
        "语言: 英语 / 韩语<br/>" +
        "上映日期: 2018-03-09(中国大陆) / 2018-02-16(美国)<br/>" +
        "片长: 134分钟 / 135分钟(中国大陆)" +
        "<br/><br/><br/>" +
        "8、环太平洋：雷霆再起<br/><br/>" +
        "导演: 斯蒂文·S·迪奈特<br/>" +
        "编剧: 斯蒂文·S·迪奈特 / 艾米丽·卡迈克尔 / 吉拉·斯奈德 / T·S·诺林 / 特拉维斯·比彻姆<br/>" +
        "主演: 约翰·博耶加 / 斯科特·伊斯特伍德 / 卡莉·史派妮 / 景甜 / 查理·戴 / 更多...<br/>" +
        "类型: 动作 / 科幻 / 冒险<br/>" +
        "制片国家/地区: 美国 / 中国大陆<br/>" +
        "语言: 英语 / 汉语普通话<br/>" +
        "上映日期: 2018-03-23(美国/中国大陆)<br/>" +
        "片长: 111分钟<br/>" +
        "又名: 环太平洋2 / 环太平洋2：雷霆再起 / 环太平洋2：起义时刻(台) / 悍战太平洋2：起义时空(港) / Pacific Rim: Maelstrom / Pacific Rim 2" +
        "<br/><br/><br/>" +
        "9、我说的都是真的<br/><br/>" +
        "导演: 刘仪伟<br/>" +
        "编剧: 刘仪伟<br/>" +
        "主演: 小沈阳 / 陈意涵 / 吴樾 / 连凯 / 罗海琼 / 更多...<br/>" +
        "类型: 喜剧 / 动作 / 悬疑<br/>" +
        "制片国家/地区: 中国大陆<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2018-03-30(中国大陆)<br/>" +
        "片长: 99分钟<br/>" +
        "又名: Really？" +
        "<br/><br/><br/>" +
        "10、起跑线<br/><br/>" +
        "导演: 萨基特·乔杜里<br/>" +
        "编剧: 萨基特·乔杜里 / 琪娜特·拉克哈尼 / 阿米托什·纳格庖<br/>" +
        "主演: 伊尔凡·可汗 / 萨巴·卡玛尔 / 内哈·迪胡皮阿 / 迪帕克·迪布里亚尔 / 蒂希塔·塞加尔 / 更多...<br/>" +
        "类型: 剧情 / 喜剧<br/>" +
        "制片国家/地区: 印度<br/>" +
        "语言: 印地语 / 英语<br/>" +
        "上映日期: 2018-04-04(中国大陆) / 2017-05-19(印度)<br/>" +
        "片长: 132分钟 / 131分钟(中国大陆)<br/>" +
        "又名: 人生起跑线(台) / 可怜天下父母心 / हिंदी" +
        "<br/><br/><br/>" +
        "11、奇葩朵朵<br/><br/>" +
        "导演: 李欣 / 李洋<br/>" +
        "主演: 张若昀 / 马思纯 / 李现 / 刘敏涛 / 姜超 / 更多...<br/>" +
        "类型: 喜剧 / 爱情<br/>" +
        "制片国家/地区: 中国大陆<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2018-04-04(中国大陆)<br/>" +
        "片长: 98分钟<br/>" +
        "又名: 简单爱 / Nuts / Science and Sensibility" +
        "<br/><br/><br/>" +
        "12、复仇者联盟3：无限战争<br/><br/>" +
        "导演: 安东尼·罗素 / 乔·罗素<br/>" +
        "编剧: 杰克·科比 / 克里斯托弗·马库斯 / 斯蒂芬·麦克菲利 / 吉姆·斯特林<br/>" +
        "主演: 小罗伯特·唐尼 / 克里斯·海姆斯沃斯 / 克里斯·埃文斯 / 马克·鲁弗洛 / 乔什·布洛林 / 更多...<br/>" +
        "类型: 动作 / 科幻 / 奇幻 / 冒险<br/>" +
        "官方网站: marvel.com/avengers<br/>" +
        "制片国家/地区: 美国<br/>" +
        "语言: 英语<br/>" +
        "上映日期: 2018-05-11(中国大陆) / 2018-04-23(加州首映) / 2018-04-27(美国)<br/>" +
        "片长: 150分钟<br/>" +
        "又名: 复联3 / 复仇者联盟：无限之战(台) / 复仇者联盟3：无尽之战 / Avengers: Infinity War - Part I / The Avengers 3: Part 1" +
        "<br/><br/><br/>" +
        "13、幕后玩家<br/><br/>" +
        "导演: 任鹏远<br/>" +
        "编剧: 任鹏远<br/>" +
        "主演: 徐峥 / 王丽坤 / 王砚辉 / 段博文 / 任达华 / 更多...<br/>" +
        "类型: 剧情 / 悬疑 / 犯罪<br/>" +
        "制片国家/地区: 中国大陆<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2018-04-28(中国大陆) / 2018-04-15(北京电影节)<br/>" +
        "片长: 114分钟<br/>" +
        "又名: 操控者 / A or B" +
        "<br/><br/><br/>" +
        "14、后来的我们<br/><br/>" +
        "导演: 刘若英<br/>" +
        "编剧: 袁媛 / 何昕明 / 潘彧 / 安巍 / 刘若英<br/>" +
        "主演: 井柏然 / 周冬雨 / 田壮壮 / 曲哲明 / 刘启恒 / 更多...<br/>" +
        "类型: 剧情 / 爱情<br/>" +
        "制片国家/地区: 中国大陆<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2018-04-28(中国大陆)<br/>" +
        "片长: 120分钟<br/>" +
        "又名: Us and Them" +
        "<br/><br/><br/>" +
        "15、香港大营救<br/><br/>" +
        "导演: 刘一君<br/>" +
        "编剧: 陆信 / 郭子胜 / 刘一君 / 刘云鹏<br/>" +
        "主演: 成泰燊 / 颜丙燕 / 梁俊一 / 霍青 / 王晖 / 更多...<br/>" +
        "类型: 剧情 / 动作 / 悬疑 / 历史<br/>" +
        "制片国家/地区: 中国大陆<br/>" +
        "语言: 汉语普通话 / 粤语 / 日语<br/>" +
        "上映日期: 2018-05-04(中国大陆)<br/>" +
        "片长: 95分钟<br/>" +
        "又名: Hong Kong Rescue" +
        "<br/><br/><br/>" +
        "16、战犬瑞克斯<br/><br/>" +
        "导演: 加芙列拉·考珀斯维特<br/>" +
        "编剧: 帕梅拉·格雷 / 安妮·玛莫罗 / 蒂姆·洛夫斯特特<br/>" +
        "主演: 凯特·玛拉 / 汤姆·费尔顿 / 布莱德利·惠特福德 / 杰拉丁妮·詹姆斯 / 科曼 / 更多...<br/>" +
        "类型: 剧情 / 传记 / 战争<br/>" +
        "制片国家/地区: 美国<br/>" +
        "语言: 英语<br/>" +
        "上映日期: 2018-05-11(中国大陆) / 2017-05-07(蒙特克莱电影节) / 2017-06-09(美国)<br/>" +
        "片长: 116分钟<br/>" +
        "又名: 梅根·利维 / 梅根李维(台) / Leavey" +
        "<br/><br/><br/>" +
        "17、命运速递<br/><br/>" +
        "导演: 李非<br/>" +
        "编剧: 李非<br/>" +
        "主演: 赵炳锐 / 吕晓霖 / 余皑磊 / 啜妮 / 张优 / 更多...<br/>" +
        "类型: 剧情 / 喜剧 / 犯罪<br/>" +
        "制片国家/地区: 中国大陆<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2018-05-25(中国大陆) / 2015-07-30(FIRST青年电影展)<br/>" +
        "片长: 90分钟 / 93分钟(中国大陆)<br/>" +
        "又名: 喊个没完 / Fate Express" +
        "<br/><br/><br/>" +
        "18、破门<br/><br/>" +
        "导演: 徐耿<br/>" +
        "编剧: 许波<br/>" +
        "主演: 马顺洗 / 李虎城 / 彭一家 / 刘炷诗嫚 / 蒲浩宇 / 更多...<br/>" +
        "类型: 剧情<br/>" +
        "制片国家/地区: 中国大陆<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2018-05-11(中国大陆)<br/>" +
        "片长: 104分钟<br/>" +
        "又名: You’ll Never Walk Alone" +
        "<br/><br/><br/>" +
        "19、龙虾刑警<br/><br/>" +
        "导演: 李昕芸<br/>" +
        "编剧: 范氿维 / 鹿迅<br/>" +
        "主演: 王千源 / 袁姗姗 / 刘桦 / 周游 / 周云鹏 / 更多...<br/>" +
        "类型: 喜剧 / 动作 / 犯罪<br/>" +
        "制片国家/地区: 中国大陆<br/>" +
        "语言: 汉语普通话<br/>" +
        "上映日期: 2018-06-22(中国大陆)<br/>" +
        "又名: Lobster Cop" +
        "<br/><br/><br/>" +
        "20、游侠索罗：星球大战外传<br/><br/>" +
        "导演: 朗·霍华德<br/>" +
        "编剧: 乔恩·卡斯丹 / 劳伦斯·卡斯丹 / 乔治·卢卡斯<br/>" +
        "主演: 阿尔登·埃伦瑞奇 / 艾米莉亚·克拉克 / 伍迪·哈里森 / 唐纳德·格洛弗 / 保罗·贝坦尼 / 更多...<br/>" +
        "类型: 动作 / 科幻 / 冒险<br/>" +
        "制片国家/地区: 美国<br/>" +
        "语言: 英语<br/>" +
        "上映日期: 2018-05-25(美国/中国大陆) / 2018-05-10(洛杉矶首映)<br/>" +
        "片长: 135分钟<br/>" +
        "又名: 韩索罗：星球大战外传(港) / 星球大战外传：游侠索罗 / 星球大战外传：索罗  / 韩索罗外传 / 星战外传2" +
        "<br/><br/><br/>" +
        "21、侏罗纪世界2<br/><br/>" +
        "导演: 胡安·安东尼奥·巴亚纳<br/>" +
        "编剧: 德里克·康纳利 / 迈克尔·克莱顿 / 科林·特雷沃罗<br/>" +
        "主演: 克里斯·帕拉特 / 布莱丝·达拉斯·霍华德 / 贾斯蒂斯·史密斯 / 拉菲·斯波 / 托比·琼斯 / 更多...<br/>" +
        "类型: 动作 / 科幻 / 冒险<br/>" +
        "制片国家/地区: 美国<br/>" +
        "语言: 英语<br/>" +
        "上映日期: 2018-06-15(中国大陆) / 2018-06-22(美国)<br/>" +
        "片长: 129分钟 / 128分钟(中国大陆)<br/>" +
        "又名: 侏罗纪世界：殒落国度(台) / 侏罗纪世界：迷失国度(港) / 侏罗纪世界2：失落王国 / Jurassic World 2<br/>" ;

    var datas = strData.split('<br/><br/><br/>');
    var films=[];
    for (var i=0;i<datas.length;i++){
        var _aFilm_=datas[i].split('<br/><br/>');
        films.push(
            {
                "desc":_aFilm_[1],
                "caption":_aFilm_[0].split('、')[1],
                "img":_aFilm_[0].replace('、',' ')
            }
        )
    }
    return films;
}